InformationRegisters/QWEP_РезультатыПоиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>QWEP_РезультатыПоиска</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АртикулПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаФормат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеФормат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метро</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторУточнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоУточнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БрендПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПоиска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/QWEP_РезультатыПоиска/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура Поиск(Команда)
	
	Если СтрДлина(РеквизитАртикулПоиска) < 4 Тогда
		Сообщить("Укажите артикул, не менее 4 символов");
		Возврат;
	КонецЕсли; 
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("article", 			РеквизитАртикулПоиска);
	ПараметрыЗапроса.Вставить("brand", 				РеквизитБрендПоиска);
	ПараметрыЗапроса.Вставить("timeout", 			РеквизитТаймаут * 1000);
	ПараметрыЗапроса.Вставить("excludePromo", 		РеквизитИсключитьПромо);
	ПараметрыЗапроса.Вставить("flatView", 			РеквизитПлоскийВид);
	ПараметрыЗапроса.Вставить("type", 				?(РеквизитАсинхронныйЗапрос, 1, 0));
	ИдентификаторПоиска = "";
	QWEP_Клиент.ВыполнитьПоиск(ПараметрыЗапроса, ИдентификаторПоиска);
	ПоискЗавершен = Ложь;
	ПополнитьРезультаты();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РеквизитПлоскийВид = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРезультаты(Команда)
	
	ПополнитьРезультаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПополнитьРезультаты()
	
	Если НЕ РеквизитАсинхронныйЗапрос ИЛИ ПустаяСтрока(ИдентификаторПоиска) Тогда
		Возврат;	
	КонецЕсли;
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("searchId", 			ИдентификаторПоиска);
	ПараметрыЗапроса.Вставить("flatView", 			РеквизитПлоскийВид);
	QWEP_Клиент.ПолучитьГотовуюПорциюРезультатов(ПараметрыЗапроса, ИдентификаторПоиска, Ложь, ПоискЗавершен);
	Элементы.Список.Обновить();
	Если НЕ ПустаяСтрока(ИдентификаторПоиска) Тогда
		ПодключитьОбработчикОжидания("ПополнитьРезультаты", 3, Истина);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
	Если НЕ Поле.Имя = "Действие" Тогда
		Возврат;	
	КонецЕсли;
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока.ЭтоУточнение Тогда
		РаскрытьУточнение(ТекущаяСтрока);
    ИначеЕсли НЕ ПустаяСтрока(ТекущаяСтрока.ИдентификаторСтроки) И ТекущаяСтрока.Действие = "Купить" Тогда
        ДобавитьВКорзину(Неопределено);
    КонецЕсли;
    Элементы.Список.Обновить();
    
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьУточнение(ТекущаяСтрока)

    ПараметрыЗапроса = Новый Структура;
    ПараметрыЗапроса.Вставить("flatView", 			РеквизитПлоскийВид);
    ПараметрыЗапроса.Вставить("clarificationId", 	ТекущаяСтрока.ИдентификаторУточнения);
    ПараметрыЗапроса.Вставить("type", 				0); //Раскрываем уточнения синхронно
    
    QWEP_Клиент.РаскрытьУточнение(ПараметрыЗапроса);
    QWEP_Сервер.УдалитьСтрокуРСРезультатыПоиска(ТекущаяСтрока.ИдентификаторСтроки);
	

КонецПроцедуры


&НаКлиенте
Процедура ДобавитьВКорзину(Команда)
    
    Количество = 1;    
    ПоказатьВводЧисла(Новый ОписаниеОповещения("ДобавитьВКорзинуПослеВвода", ЭтотОбъект, ), Количество, "Введите необходимое количество"); 
    
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВКорзинуПослеВвода(Число, ДополнительныеПараметры) Экспорт
    
    Если НЕ Число = Неопределено И Число > 0 Тогда
		ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
        Если ТекущаяСтрока = Неопределено Тогда                	
            Возврат;
        КонецЕсли;          
        
        ПараметрыЗапроса = Новый Структура;
        ПараметрыЗапроса.Вставить("itemId", 			ТекущаяСтрока.ИдентификаторСтроки);
        ПараметрыЗапроса.Вставить("quantity", 	        Число);
        ПараметрыЗапроса.Вставить("comment", 	        "Тестовый комментарий API"); 
        ПараметрыЗапроса.Вставить("type", 				0); //Раскрываем уточнения синхронно
		
		УспешноДобавлен = QWEP_Клиент.ДобавитьВКорзину(ПараметрыЗапроса);
        Если УспешноДобавлен Тогда                	
            Сообщить("Товар успешно добавлен в корзину");
        Иначе
            Сообщить("Во время добавления товара в корзину возникли ошибки");
		КонецЕсли; 
    КонецЕсли;

КонецПроцедуры
